시리즈: 1차원 배열과 같은 자료구조로 배열로부터 생성, 인덱스를 가지고 있다

In [1]:
import pandas as pd
from pandas import Series, DataFrame
import numpy as np
import matplotlib.pyplot as plt

In [343]:
obj=Series([3,1,-5,2])
obj

0    3
1    1
2   -5
3    2
dtype: int64

In [344]:
obj[0:3]

0    3
1    1
2   -5
dtype: int64

In [6]:
obj.values

array([ 3,  1, -5,  2], dtype=int64)

인덱스는 저장된 데이터의 이름(default는 0번부터 번호)  
인덱스는 행 인덱스와 열 인덱스가 있다  
인덱스를 이용하여 자료를 참조(loc, iloc)

In [5]:
obj.index

RangeIndex(start=0, stop=4, step=1)

In [286]:
obj=pd.Series([3,1,-5,2], index=['d','a','b','c'])
obj

d    3
a    1
b   -5
c    2
dtype: int64

In [287]:
obj.index=['a','b','c','d']
obj

a    3
b    1
c   -5
d    2
dtype: int64

In [280]:
obj[obj>2]

0    3
dtype: int64

In [14]:
obj['b']

1

In [16]:
obj[['c','a']] #여러개 행/열 인덱스 참조

c   -5
a    3
dtype: int64

In [283]:
#불리안 참조
obj[obj>0]

0    3
1    1
3    2
dtype: int64

In [284]:
obj*2

0     6
1     2
2   -10
3     4
dtype: int64

시리즈는 벡터이므로 연산가능, 함수적용가능, 불리안 참조가능

In [19]:
np.exp(obj)

a    20.085537
b     2.718282
c     0.006738
d     7.389056
dtype: float64

인덱스로 불리안 참조

In [291]:
obj['a' in obj]

1

In [288]:
obj['a' in obj]

1

딕셔너리로 생성

In [266]:
sdata={'Seoul':1000, 'Incheon':200, 'Gwangju':100, 'Busan':300}

In [50]:
obj2=pd.core.series.Series(sdata)

In [51]:
obj2

Seoul      1000
Incheon     200
Gwangju     100
Busan       300
dtype: int64

In [36]:
city=['Seoul','Incheon','Gwangju','Suwon']

In [40]:
obj3=pd.Series(sdata, index=city)

In [41]:
pd.isnull(obj3)

Seoul      False
Incheon    False
Gwangju    False
Suwon       True
dtype: bool

In [42]:
pd.notnull(obj3)

Seoul       True
Incheon     True
Gwangju     True
Suwon      False
dtype: bool

In [43]:
obj3.isnull()

Seoul      False
Incheon    False
Gwangju    False
Suwon       True
dtype: bool

요소 삭제

In [52]:
del obj2['Gwangju']
obj2

Seoul      1000
Incheon     200
Busan       300
dtype: int64

In [47]:
for k,v in obj2.items():
    print(k,v)

Seoul 1000
Incheon 200
Gwangju 100
Suwon 300

In [60]:
data = {
    "2015": [9904312, 3448737, 2890451, 2466052],
    "2010": [9631482, 3393191, 2632035, 2431774],
    "2005": [9762546, 3512547, 2517680, 2456016],
    "2000": [9853972, 3655437, 2466338, 2473990],
    "지역": ["수도권", "경상권", "수도권", "경상권"],
    "2010-2015 증가율": [0.0283, 0.0163, 0.0982, 0.0141]
}
cols = ["지역", "2015", "2010", "2005", "2000", "2010-2015 증가율"]
idx = ["서울", "부산", "인천", "대구"]

In [55]:
pd.Series(data)

2015             [9904312, 3448737, 2890451, 2466052]
2010             [9631482, 3393191, 2632035, 2431774]
2005             [9762546, 3512547, 2517680, 2456016]
2000             [9853972, 3655437, 2466338, 2473990]
지역                               [수도권, 경상권, 수도권, 경상권]
2010-2015 증가율        [0.0283, 0.0163, 0.0982, 0.0141]
dtype: object

In [69]:
df=pd.DataFrame(data, index=idx, columns=cols)
df

     지역     2015     2010     2005     2000  2010-2015 증가율
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

열이 되는 1차원 데이터 배열 또는 리스트 작성  
열에 대한 이름을 키로 갖는 딕셔너리 작성  
행방향 인덱스 :index, 열방향 인덱스:columns  
같은 열은 동일한 데이터타입, 행끼리는 달라도 된다

In [65]:
df.values

array([['수도권', 9904312, 9631482, 9762546, 9853972, 0.0283],
       ['경상권', 3448737, 3393191, 3512547, 3655437, 0.0163],
       ['수도권', 2890451, 2632035, 2517680, 2466338, 0.0982],
       ['경상권', 2466052, 2431774, 2456016, 2473990, 0.0141]], dtype=object)

In [66]:
df.index

Index(['서울', '부산', '인천', '대구'], dtype='object')

In [67]:
df.columns

Index(['지역', '2015', '2010', '2005', '2000', '2010-2015 증가율'], dtype='object')

In [72]:
df.index.name='도시'
df.columns.name='특징'
df

특징   지역     2015     2010     2005     2000  2010-2015 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283
부산  경상권  3448737  3393191  3512547  3655437         0.0163
인천  수도권  2890451  2632035  2517680  2466338         0.0982
대구  경상권  2466052  2431774  2456016  2473990         0.0141

In [77]:
#2005-2010 증가율 컬럼 추가
#(2010-2005)/2005
df['2005-2010 증가율']=(df['2010']-df['2005'])/df['2005']
df

특징   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283      -0.013425
부산  경상권  3448737  3393191  3512547  3655437         0.0163      -0.033980
인천  수도권  2890451  2632035  2517680  2466338         0.0982       0.045421
대구  경상권  2466052  2431774  2456016  2473990         0.0141      -0.009870

In [82]:
type(df['지역']) #시리즈
type(df[['지역']]) #데이터프레임

pandas.core.frame.DataFrame

In [83]:
df[['2010','2015']]

특징     2010     2015
도시
서울  9631482  9904312
부산  3393191  3448737
인천  2632035  2890451
대구  2431774  2466052

In [84]:
pd.DataFrame(np.arange(12).reshape(3,4))

   0  1   2   3
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [85]:
df[:1]

특징   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
서울  수도권  9904312  9631482  9762546  9853972         0.0283      -0.013425

In [91]:
df[1:4]
df['부산':'대구']

특징   지역     2015     2010     2005     2000  2010-2015 증가율  2005-2010 증가율
도시
부산  경상권  3448737  3393191  3512547  3655437         0.0163      -0.033980
인천  수도권  2890451  2632035  2517680  2466338         0.0982       0.045421
대구  경상권  2466052  2431774  2456016  2473990         0.0141      -0.009870

In [93]:
df['2000']['인천']

2466338

In [94]:
%%writefile sample1.csv
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample1.csv

파일 만들어서 저장하기

In [98]:
pd.read_csv('sample1.csv')

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [101]:
#특정 열을 행인덱스로 사용하기
pd.read_csv('sample1.csv',index_col='c1')

      c2      c3
c1
1   1.11     one
2   2.22     two
3   3.33   three

In [102]:
%%writefile sample3.txt
c1        c2        c3        c4
0.179181 -1.538472  1.347553  0.43381
1.024209  0.087307 -1.281997  0.49265
0.417899 -2.002308  0.255245 -1.10515

Writing sample3.txt

In [103]:
pd.read_table('sample3.txt',sep='\s+') #\s는 공백문자

         c1        c2        c3       c4
0  0.179181 -1.538472  1.347553  0.43381
1  1.024209  0.087307 -1.281997  0.49265
2  0.417899 -2.002308  0.255245 -1.10515

In [104]:
%%writefile sample4.txt
파일 제목: sample4.txt
데이터 포맷의 설명:
c1, c2, c3
1, 1.11, one
2, 2.22, two
3, 3.33, three

Writing sample4.txt

In [106]:
pd.read_csv('sample4.txt',skiprows=[0,1])

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [108]:
pd.read_csv('sample4.txt',skiprows=2)

   c1    c2      c3
0   1  1.11     one
1   2  2.22     two
2   3  3.33   three

In [109]:
%%writefile sample5.csv
c1, c2, c3
1, 1.11, one
2, , two
누락, 3.33, three

Writing sample5.csv

In [129]:
what=pd.read_csv('sample5.csv',na_values=['누락',' '])

In [134]:
what.to_csv('sample6.csv',encoding='euc-kr')

In [135]:
!type sample6.csv

,c1, c2, c3
0,1.0,1.11, one
1,2.0,, two
2,,3.33, three

In [132]:
what.to_csv('sample7.txt',sep='|', encoding='euc-kr')

In [133]:
!type sample7.txt

|c1| c2| c3
0|1.0|1.11| one
1|2.0|| two
2||3.33| three

In [130]:
what.to_csv('sample8.csv',na_rep='누락', encoding='euc-kr')

In [131]:
!type sample8.csv

,c1, c2, c3
0,1.0,1.11, one
1,2.0,누락, two
2,누락,3.33, three

In [138]:
what.index=['a','b','c']
what

    c1    c2      c3
a  1.0  1.11     one
b  2.0   NaN     two
c  NaN  3.33   three

In [141]:
what.to_csv('sample9.csv')
what.to_csv('sample9.csv',index=False) #행 인덱스 제거
what.to_csv('sample9.csv',index=False, header=False) #열 인덱스 제거

In [144]:
df=pd.read_csv('https://raw.githubusercontent.com/CSSEGISandData/COVID-19/master/csse_covid_19_data/csse_covid_19_time_series/time_series_covid19_confirmed_global.csv')

In [145]:
df

,Province/State,Country/Region,Lat,Long,1/22/20,1/23/20,1/24/20,1/25/20,1/26/20,1/27/20,...,3/14/21,3/15/21,3/16/21,3/17/21,3/18/21,3/19/21,3/20/21,3/21/21,3/22/21,3/23/21
0,NaN,Afghanistan,33.939110,67.709953,0,0,0,0,0,0,...,55985,55985,55995,56016,56044,56069,56093,56103,56153,56177
1,NaN,Albania,41.153300,20.168300,0,0,0,0,0,0,...,117474,118017,118492,118938,119528,120022,120541,121200,121544,121847
2,NaN,Algeria,28.033900,1.659600,0,0,0,0,0,0,...,115265,115410,115540,115688,115842,115970,116066,116157,116255,116349
3,NaN,Andorra,42.506300,1.521800,0,0,0,0,0,0,...,11266,11289,11319,11360,11393,11431,11481,11517,11545,11591
4,NaN,Angola,-11.202700,17.873900,0,0,0,0,0,0,...,21380,21407,21446,21489,21558,21642,21696,21733,21757,21774
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
269,NaN,Vietnam,14.058324,108.277199,0,2,2,2,2,2,...,2554,2557,2560,2567,2570,2571,2572,2572,2575,2575
270,NaN,West Bank and Gaza,31.952200,35.233200,0,0,0,0,0,0,...,209304,211602,213791,215984,218061,219912,221391,223638,225976,228044
271,NaN,Yemen,15.552727,48.516388,0,0,0,0,0,0,...,2836,2908,2969,3037,3126,3217,3278,3418,3516,3612
272,NaN,Zambia,-13.133897,27.849332,0,0,0,0,0,0,...,84797,84950,85240,85502,85889,86059,86273,86449,86535,86779
273,NaN,Zimbabwe,-19.015438,29.154857,0,0,0,0,0,0,...,36484,36504,36535,36552,36611,36652,36662,36665,36684,36717

In [2]:
gap=pd.read_csv('pandas_data/gapminder.tsv',sep='\t')
gap

          country continent  year  lifeExp       pop   gdpPercap
0     Afghanistan      Asia  1952   28.801   8425333  779.445314
1     Afghanistan      Asia  1957   30.332   9240934  820.853030
2     Afghanistan      Asia  1962   31.997  10267083  853.100710
3     Afghanistan      Asia  1967   34.020  11537966  836.197138
4     Afghanistan      Asia  1972   36.088  13079460  739.981106
...           ...       ...   ...      ...       ...         ...
1699     Zimbabwe    Africa  1987   62.351   9216418  706.157306
1700     Zimbabwe    Africa  1992   60.377  10704340  693.420786
1701     Zimbabwe    Africa  1997   46.809  11404948  792.449960
1702     Zimbabwe    Africa  2002   39.989  11926563  672.038623
1703     Zimbabwe    Africa  2007   43.487  12311143  469.709298

[1704 rows x 6 columns]

In [4]:
np.ndim(gap)
np.shape(gap)
gap.size
gap.index
gap.columns
type(gap)
gap.dtypes

country       object
continent     object
year           int64
lifeExp      float64
pop            int64
gdpPercap    float64
dtype: object

In [5]:
gap.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

loc:라벨 인덱스로 데이터 추출  
iloc:정수 인덱스로 데이터 추출

In [8]:
df = pd.DataFrame(np.arange(10, 22).reshape(3, 4),
                  index=["a", "b", "c"],
                  columns=["A", "B", "C", "D"])
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [9]:
df.loc['a'] # a행 인덱스가 시리즈 형태로 추출

A    10
B    11
C    12
D    13
Name: a, dtype: int32

In [15]:
#범위를 줄때는 loc 사용 해도되고 안해도됨
df['a':'b'] 
df.loc['a':'b']
#서로 떨어진 행
df.loc[['a','c']]

    A   B   C   D
a  10  11  12  13
c  18  19  20  21

In [337]:
df.A #A열 시리즈로 추출 df$A
df['A']

AttributeError: 'DataFrame' object has no attribute 'A'

In [20]:
df.loc[df.A>15] #A열이 15보다 큰 행 전체 추출

    A   B   C   D
c  18  19  20  21

In [21]:
def select_rows(df):
    return df.A>15

In [23]:
df.loc[select_rows(df)]

    A   B   C   D
c  18  19  20  21

In [25]:
df2 = pd.DataFrame(np.arange(10, 26).reshape(4, 4), columns=["A", "B", "C", "D"])
df2

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [28]:
df2.loc[1,'A'] #행 인덱스 1, 열 인덱스 A

14

결과는 동일하지만 의미가 다름. 밑은 잘 안씀

In [31]:
df2.loc[1].loc['A'] #행인덱스1 추출. 그 시리즈에서 행 인덱스 A인 자료 추출

14

In [37]:
df2.loc[1:,'A']
df2.loc[1,:]

A    14
B    15
C    16
D    17
Name: 1, dtype: int32

In [58]:
#11 13
#15 17 추출

df.loc[['a','b'],['B','D']]
df.loc['a':'b',['B','D']] #끝 인덱스 포함
df.loc[:'b',['B','D']]
df.loc[df.A>10,['B','D']]

    B   D
b  15  17
c  19  21

In [60]:
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [81]:
df.iloc[1,3]
df.iloc[:2]
#12 13
#19 20
#18 19 20 21
df.iloc[0,:-1]

A    10
B    11
C    12
Name: a, dtype: int32

In [365]:
gap=pd.read_csv('pandas_data/gapminder.tsv',sep='\t')

In [366]:
gap.head()

       country continent  year  lifeExp       pop   gdpPercap
0  Afghanistan      Asia  1952   28.801   8425333  779.445314
1  Afghanistan      Asia  1957   30.332   9240934  820.853030
2  Afghanistan      Asia  1962   31.997  10267083  853.100710
3  Afghanistan      Asia  1967   34.020  11537966  836.197138
4  Afghanistan      Asia  1972   36.088  13079460  739.981106

In [369]:
gap.info()
gap.iloc[[1703]]
gap.loc[[99]]

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1704 entries, 0 to 1703
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   country    1704 non-null   object
 1   continent  1704 non-null   object
 2   year       1704 non-null   int64
 3   lifeExp    1704 non-null   float64
 4   pop        1704 non-null   int64
 5   gdpPercap  1704 non-null   float64
dtypes: float64(2), int64(2), object(2)
memory usage: 80.0+ KB

       country continent  year  lifeExp       pop   gdpPercap
99  Bangladesh      Asia  1967   43.453  62821884  721.186086

In [94]:
gap.iloc[-1] #뒤에서 첫번째
gap.loc[-1] #-1이라는 라벨 (에러)

country      Zimbabwe
continent      Africa
year             2007
lifeExp        43.487
pop          12311143
gdpPercap     469.709
Name: 1703, dtype: object

In [100]:
gap.loc[gap.shape[0]-1]
gap.loc[[0,99,999]]

         country continent  year  lifeExp       pop    gdpPercap
0    Afghanistan      Asia  1952   28.801   8425333   779.445314
99    Bangladesh      Asia  1967   43.453  62821884   721.186086
999     Mongolia      Asia  1967   51.253   1149500  1226.041130

In [102]:
gap.loc[:4,['year','pop']]

   year       pop
0  1952   8425333
1  1957   9240934
2  1962  10267083
3  1967  11537966
4  1972  13079460

In [104]:
s=pd.Series(range(10))
s

0    0
1    1
2    2
3    3
4    4
5    5
6    6
7    7
8    8
9    9
dtype: int64

In [105]:
np.random.seed(2)
df = pd.DataFrame(np.random.randint(5, size=(4, 4)), dtype=float)
df

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  4.0
3  4.0  3.0  4.0  2.0

In [107]:
df.iloc[2,3]=np.nan

In [109]:
df.info()
df

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       4 non-null      float64
 1   1       4 non-null      float64
 2   2       4 non-null      float64
 3   3       3 non-null      float64
dtypes: float64(4)
memory usage: 256.0 bytes

     0    1    2    3
0  0.0  0.0  3.0  2.0
1  3.0  0.0  2.0  1.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [110]:
df.count() #열단위로 유효한 데이터 개수

0    4
1    4
2    4
3    3
dtype: int64

In [114]:
t=pd.read_csv('C:/rwork/insurance.csv')
t.count()

age         1338
sex         1338
bmi         1338
children    1338
smoker      1338
region      1338
expenses    1338
dtype: int64

In [117]:
np.random.seed(1)
s2 = pd.Series(np.random.randint(6, size=100))
s2

0     5
1     3
2     4
3     0
4     1
     ..
95    4
96    5
97    2
98    4
99    3
Length: 100, dtype: int32

In [116]:
s2.value_counts() #table함수처럼 각 데이터별 개수 세줌

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [118]:
s2.value_counts().sort_index()

0    18
1    22
2    13
3    14
4    17
5    16
dtype: int64

In [119]:
s2.sort_values() #값 오름차순 정렬

57    0
38    0
39    0
85    0
28    0
     ..
71    5
40    5
46    5
11    5
0     5
Length: 100, dtype: int32

In [123]:
#데이터프레임 정렬
df.sort_values(by=2)

     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [126]:
df.sort_values(by=[1,3]) #기준 여러개

     0    1    2    3
1  3.0  0.0  2.0  1.0
0  0.0  0.0  3.0  2.0
2  3.0  2.0  4.0  NaN
3  4.0  3.0  4.0  2.0

In [127]:
np.random.seed(1)
df2 = pd.DataFrame(np.random.randint(10, size=(4, 8)))
df2

   0  1  2  3  4  5  6  7
0  5  8  9  5  0  0  1  7
1  6  9  2  4  5  2  4  2
2  4  7  7  9  1  7  0  6
3  9  9  7  6  9  1  0  1

In [128]:
df2.sum() #열 별로

0    24
1    33
2    25
3    24
4    15
5    10
6     5
7    16
dtype: int64

In [131]:
df2.sum(axis=1) #행 별로

0    35
1    34
2    41
3    42
dtype: int64

In [133]:
df3 = pd.DataFrame({
    'A': [1, 3, 4, 3, 4],
    'B': [2, 3, 1, 2, 3],
    'C': [1, 5, 2, 4, 4]
})
df3

   A  B  C
0  1  2  1
1  3  3  5
2  4  1  2
3  3  2  4
4  4  3  4

In [138]:
df3['A'].max()-df3['A'].min()

3

In [140]:
df3.apply(max) #각 열마다 함수 적용

A    4
B    3
C    5
dtype: int64

In [141]:
df3.apply(max)-df3.apply(min)

A    3
B    2
C    4
dtype: int64

In [144]:
df3.apply(lambda x: x.max()-x.min()) #x에는 df3에 있는 각각의 열이 전달됨
#axis=0 생략되어있음

A    3
B    2
C    4
dtype: int64

In [145]:
df3.apply(lambda x: x.max()-x.min(),axis=1) #행단위로

0    1
1    2
2    3
3    2
4    1
dtype: int64

In [149]:
df3.apply(lambda x: x.value_counts())

     A    B    C
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [151]:
#titanic 나이 20 이상이면 adult 아니면 child

t['adult_child']=t.apply(lambda x: 'adult' if x.age>=20 else 'child', axis=1)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [157]:
#fillna #na를 0으로 채우기
df3.apply(pd.value_counts).fillna(0)

     A    B    C
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

In [162]:
#정수로 나오게 전체 데이터 타입 바꾸기
df3.apply(pd.value_counts).fillna(0).astype(int)

   A  B  C
1  1  1  1
2  0  2  1
3  2  2  0
4  2  0  2
5  0  0  1

In [172]:
#수치데이터 범주화
#cut : 실수값으로 경계 지정
#qcut : 똑같은 개수의 구간
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]
bins=[1,20,30,50,100]
lb=['minor','begin','mid','old']

In [182]:
pd.cut(ages,bins,labels=lb).value_counts()

minor    3
begin    2
mid      4
old      1
dtype: int64

In [181]:
pd.qcut(ages,4,labels=lb).value_counts()

minor    3
begin    3
mid      3
old      3
dtype: int64

In [183]:
mycuts=pd.cut(ages,bins,labels=lb)
mycuts.categories

Index(['minor', 'begin', 'mid', 'old'], dtype='object')

In [184]:
mycuts.codes #어느 영역에 속하는지 인덱스값(-1은 na값)

array([-1,  0,  0,  1,  1,  2,  2,  3,  0,  2,  2, -1], dtype=int8)

In [191]:
df4=pd.DataFrame(ages, columns=['ages'])
df4['category']=pd.cut(ages,bins,labels=lb)
df4

    ages category
0      0      NaN
1      2    minor
2     10    minor
3     21    begin
4     23    begin
5     37      mid
6     31      mid
7     61      old
8     20    minor
9     41      mid
10    32      mid
11   101      NaN

In [192]:
df4.info() #범주형은 category(R의 factor)

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ages      12 non-null     int64
 1   category  10 non-null     category
dtypes: category(1), int64(1)
memory usage: 428.0 bytes

In [198]:
df4['combine']=df4['category'].astype(str)+' who is age '+df4['ages'].astype(str)
df4

    ages category              combine
0      0      NaN     nan who is age 0
1      2    minor   minor who is age 2
2     10    minor  minor who is age 10
3     21    begin  begin who is age 21
4     23    begin  begin who is age 23
5     37      mid    mid who is age 37
6     31      mid    mid who is age 31
7     61      old    old who is age 61
8     20    minor  minor who is age 20
9     41      mid    mid who is age 41
10    32      mid    mid who is age 32
11   101      NaN   nan who is age 101

In [483]:
data=np.random.randint(20,size=10)
data

array([ 1,  0, 17,  8, 13, 19, 15, 10,  8,  7])

In [485]:
mycuts2=pd.qcut(data,4,labels=['q1','q2','q3','q4'])
mycuts2

[q1, q1, q4, q2, q3, q4, q4, q3, q2, q1]
Categories (4, object): [q1 < q2 < q3 < q4]

In [219]:

pd.value_counts(mycuts2)

q1    4
q4    3
q3    2
q2    1
dtype: int64

In [217]:
pd.DataFrame(data,mycuts2,columns=['age'])

    age
q4   19
q1    1
q1    2
q4   12
q2    7
q1    2
q3   10
q1    0
q3    9
q4   18

In [218]:
pd.value_counts(mycuts2)

q1    4
q4    3
q3    2
q2    1
dtype: int64

In [220]:
np.random.seed(0)
df1 = pd.DataFrame(np.vstack([list('ABCDE'),
                              np.round(np.random.rand(3, 5), 2)]).T,
                   columns=["C1", "C2", "C3", "C4"])

In [224]:
#멀티인덱스
np.random.seed(0)
df3 = pd.DataFrame(np.round(np.random.randn(5, 4), 2),
                  columns=[['A','A','B','B'],['M','F','M','F']])
df3

      A           B
      M     F     M     F
0  1.76  0.40  0.98  2.24
1  1.87 -0.98  0.95 -0.15
2 -0.10  0.41  0.14  1.45
3  0.76  0.12  0.44  0.33
4  1.49 -0.21  0.31 -0.85

In [313]:
np.random.seed(1)
df=pd.DataFrame(np.random.randint(20,size=(5,6)),
            columns=['c1','c2','c3','c4','c5','c6'],
    index=['하나','둘','셋','넷','다섯'])
df

    c1  c2  c3  c4  c5  c6
하나   5  11  12   8   9  11
둘    5  15   0  16   1  12
셋    7  13   6  18   5  18
넷   11  10  14  18   4   9
다섯  17   0  13   9   9   7

In [430]:
df.loc['sum',:]=df.sum()
df

        c1     c2     c3     c4    c5     c6
하나     5.0   11.0   12.0    8.0   9.0   11.0
둘      5.0   15.0    0.0   16.0   1.0   12.0
셋      7.0   13.0    6.0   18.0   5.0   18.0
넷     11.0   10.0   14.0   18.0   4.0    9.0
다섯    17.0    0.0   13.0    9.0   9.0    7.0
sum  135.0  147.0  135.0  207.0  84.0  171.0

In [292]:
df.index.name='숫자'
df.columns.name='열이름'
df

열이름  c1  c2  c3  c4  c5  c6
숫자
하나    5  11  12   8   9  11
둘     5  15   0  16   1  12
셋     7  13   6  18   5  18
넷    11  10  14  18   4   9
다섯   17   0  13   9   9   7

In [312]:
df[3]

0     8
1    16
2    18
3    18
4     9
Name: 3, dtype: int32

In [293]:
df[['c1','c5']] #c1열과 c5열

열이름  c1  c5
숫자
하나    5   9
둘     5   1
셋     7   5
넷    11   4
다섯   17   9

In [300]:
df[['c2']] #c1열부터 c3열까지

열이름  c2
숫자
하나   11
둘    15
셋    13
넷    10
다섯    0

In [314]:
df['하나':'셋'] #0행부터 2행까지

    c1  c2  c3  c4  c5  c6
하나   5  11  12   8   9  11
둘    5  15   0  16   1  12
셋    7  13   6  18   5  18

In [261]:
df.iloc[2:5]

    c1  c2  c3  c4  c5  c6
숫자
셋    7  13   6  18   5  18
넷   11  10  14  18   4   9
다섯  17   0  13   9   9   7

In [317]:
df.loc['둘':'넷','c2':'c4']

   c2  c3  c4
둘  15   0  16
셋  13   6  18
넷  10  14  18

In [328]:
df.loc[['하나','셋']]

    c1  c2  c3  c4  c5  c6
하나   5  11  12   8   9  11
셋    7  13   6  18   5  18

In [347]:
df.loc['넷':,'c1':'c3']

    c1  c2  c3
넷   11  10  14
다섯  17   0  13

In [355]:
df.loc[df.c1>10,['c3','c4']]

    c3  c4
넷   14  18
다섯  13   9

In [364]:
df.iloc[2:,3:]
df.iloc[0:1,-2:]

    c5  c6
하나   9  11

In [373]:
df.count()

c1    5
c2    5
c3    5
c4    5
c5    5
c6    5
dtype: int64

In [225]:
import seaborn as sns
t=sns.load_dataset('titanic')
t

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [375]:
t.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [395]:
t.groupby('age').count()

,survived,pclass,sex,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
age,,,,,,,,,,,,,,
0.42,1,1,1,1,1,1,1,1,1,1,0,1,1,1
0.67,1,1,1,1,1,1,1,1,1,1,0,1,1,1
0.75,2,2,2,2,2,2,2,2,2,2,0,2,2,2
0.83,2,2,2,2,2,2,2,2,2,2,0,2,2,2
0.92,1,1,1,1,1,1,1,1,1,1,1,1,1,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
70.00,2,2,2,2,2,2,2,2,2,2,1,2,2,2
70.50,1,1,1,1,1,1,1,1,1,1,0,1,1,1
71.00,2,2,2,2,2,2,2,2,2,2,1,2,2,2
74.00,1,1,1,1,1,1,1,1,1,1,0,1,1,1
80.00,1,1,1,1,1,1,1,1,1,1,1,1,1,1

In [389]:
len(t)-t.count()

survived         0
pclass           0
sex              0
age            177
sibsp            0
parch            0
fare             0
embarked         2
class            0
who              0
adult_male       0
deck           688
embark_town      2
alive            0
alone            0
dtype: int64

In [386]:
t.iloc[:,0].value_counts()

0    549
1    342
Name: survived, dtype: int64

In [409]:
t.sort_index(ascending=False)
t.sort_values(by=['fare','age'],ascending=False)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,yes,False
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,yes,True
438,0,1,male,64.0,1,4,263.0000,S,First,man,True,C,Southampton,no,False
341,1,1,female,24.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
481,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
633,0,1,male,NaN,0,0,0.0000,S,First,man,True,NaN,Southampton,no,True
674,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
732,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
815,0,1,male,NaN,0,0,0.0000,S,First,man,True,B,Southampton,no,True

In [417]:
t['sex'].value_counts()
t['age'].value_counts()
t['class'].value_counts()
t['survived'].value_counts()

0    549
1    342
Name: survived, dtype: int64

In [418]:
t.sum(axis=1)

0       34.2500
1      112.2833
2       38.9250
3       91.1000
4       48.0500
         ...
886     44.0000
887     52.0000
888     29.4500
889     60.0000
890     44.7500
Length: 891, dtype: float64

In [433]:
t['age'].mean() #승객 평균 나이

29.69911764705882

In [439]:
t.age[t['sex']=='female'].mean() #여성 승객 평균 나이

27.915708812260537

In [444]:
t.age[(t['sex']=='female')&(t['class']=='First')].mean() #1등실 여성 승객 평균 나이

34.61176470588235

In [460]:
t['category1']=t.apply(lambda x: x.sex if x.age>20 else 'child', axis=1)

In [462]:
t.age.mean()

29.69911764705882

In [467]:
t.age=t.age.fillna(t.age.mean())

In [480]:
t['category2']=t.sex.astype(str)+t.age.round().astype(str)
t

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,category1,category2
0,0,3,male,22.000000,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,male,male22.0
1,1,1,female,38.000000,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,female,female38.0
2,1,3,female,26.000000,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,female,female26.0
3,1,1,female,35.000000,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,female,female35.0
4,0,3,male,35.000000,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,male,male35.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.000000,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,male,male27.0
887,1,1,female,19.000000,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,child,female19.0
888,0,3,female,29.699118,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,child,female30.0
889,1,1,male,26.000000,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,male,male26.0
890,0,3,male,32.000000,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,male,male32.0

In [487]:
ages = [0, 2, 10, 21, 23, 37, 31, 61, 20, 41, 32, 101]
bins=[1,20,30,50,100] #(]
lb=['minor','begin','mid','old']

mycuts=pd.cut(ages,bins,labels=lb)
mycuts

[NaN, minor, minor, begin, begin, ..., old, minor, mid, mid, NaN]
Length: 12
Categories (4, object): [minor < begin < mid < old]

In [488]:
mycuts.value_counts()

minor    3
begin    2
mid      4
old      1
dtype: int64

In [490]:
mycuts2=pd.qcut(ages,4,labels=lb)
mycuts2

[minor, minor, minor, begin, begin, ..., old, begin, old, mid, old]
Length: 12
Categories (4, object): [minor < begin < mid < old]

In [491]:
mycuts2.value_counts()

minor    3
begin    3
mid      3
old      3
dtype: int64

In [492]:
mycuts.categories

Index(['minor', 'begin', 'mid', 'old'], dtype='object')

In [493]:
mycuts.codes

array([-1,  0,  0,  1,  1,  2,  2,  3,  0,  2,  2, -1], dtype=int8)

In [497]:
type(mycuts)

pandas.core.arrays.categorical.Categorical

In [496]:
df4=pd.DataFrame(ages, columns=['ages'])
df4['category']=pd.cut(ages,bins,labels=lb)

df4.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   ages      12 non-null     int64
 1   category  10 non-null     category
dtypes: category(1), int64(1)
memory usage: 428.0 bytes

pandas.core.series.Series

In [498]:
df4['category'].astype(str)+df4['ages'].astype(str)

0        nan0
1      minor2
2     minor10
3     begin21
4     begin23
5       mid37
6       mid31
7       old61
8     minor20
9       mid41
10      mid32
11     nan101
dtype: object

In [516]:
bins=[1, 20, 30, 50, 70, 100]
labels=["미성년자", "청년", "중년", "장년", "노년"]
cat=pd.cut(t.age,bins,labels=labels)
cat.value_counts()/cat.size

청년      0.456790
중년      0.270483
미성년자    0.185185
장년      0.066218
노년      0.005612
Name: age, dtype: float64

In [518]:
np.random.seed(0)
df1 = pd.DataFrame(np.vstack([list('ABCDE'),
                              np.round(np.random.rand(3, 5), 2)]).T,
                   columns=["C1", "C2", "C3", "C4"])
df1

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [527]:
df2=df1.set_index('C1')

In [528]:
df2.reset_index()

  C1    C2    C3    C4
0  A  0.55  0.65  0.79
1  B  0.72  0.44  0.53
2  C   0.6  0.89  0.57
3  D  0.54  0.96  0.93
4  E  0.42  0.38  0.07

In [529]:
np.random.seed(0)
df3 = pd.DataFrame(np.round(np.random.randn(5, 4), 2),
                   columns=[["A", "A", "B", "B"],
                            ["C1", "C2", "C1", "C2"]])
df3

      A           B
     C1    C2    C1    C2
0  1.76  0.40  0.98  2.24
1  1.87 -0.98  0.95 -0.15
2 -0.10  0.41  0.14  1.45
3  0.76  0.12  0.44  0.33
4  1.49 -0.21  0.31 -0.85

In [541]:
df4=pd.DataFrame(np.round(np.random.randn(6,4),2),
             columns=[['A','A','B','B'],
                     ['D','C','D','C']],
             index=[['M','M','M','F','F','F'],
                   ['id_'+str(i+1) for i in range(3)]*2])
df4.columns.names=['A-SQUAD','C-SQUAD']
df4.index.names=['gender','id']
df4

A-SQUAD         A           B
C-SQUAD         D     C     D     C
gender id
M      id_1  2.38  0.94 -0.91  1.12
       id_2 -1.32 -0.46 -0.07  1.71
       id_3 -0.74 -0.83 -0.10 -0.66
F      id_1  1.13 -1.08 -1.15 -0.44
       id_2 -0.50  1.93  0.95  0.09
       id_3 -1.23  0.84 -1.00 -1.54

In [537]:
['id'+str(i+1) for i in range(3)]*2

['id1', 'id2', 'id3', 'id1', 'id2', 'id3']

In [544]:
df4.stack('C-SQUAD')

A-SQUAD                 A     B
gender id   C-SQUAD
M      id_1 C        0.94  1.12
            D        2.38 -0.91
       id_2 C       -0.46  1.71
            D       -1.32 -0.07
       id_3 C       -0.83 -0.66
            D       -0.74 -0.10
F      id_1 C       -1.08 -0.44
            D        1.13 -1.15
       id_2 C        1.93  0.09
            D       -0.50  0.95
       id_3 C        0.84 -1.54
            D       -1.23 -1.00

In [545]:
df4.unstack('gender')

A-SQUAD     A                       B
C-SQUAD     D           C           D           C
gender      F     M     F     M     F     M     F     M
id
id_1     1.13  2.38 -1.08  0.94 -1.15 -0.91 -0.44  1.12
id_2    -0.50 -1.32  1.93 -0.46  0.95 -0.07  0.09  1.71
id_3    -1.23 -0.74  0.84 -0.83 -1.00 -0.10 -1.54 -0.66

In [568]:
df4

A-SQUAD         A           B
C-SQUAD         D     C     D     C
gender id
M      id_1  2.38  0.94 -0.91  1.12
       id_2 -1.32 -0.46 -0.07  1.71
       id_3 -0.74 -0.83 -0.10 -0.66
F      id_1  1.13 -1.08 -1.15 -0.44
       id_2 -0.50  1.93  0.95  0.09
       id_3 -1.23  0.84 -1.00 -1.54

In [575]:
df4.iloc[3,2]

-1.15

In [585]:
df4['A']

C-SQUAD         D     C
gender id
M      id_1  2.38  0.94
       id_2 -1.32 -0.46
       id_3 -0.74 -0.83
F      id_1  1.13 -1.08
       id_2 -0.50  1.93
       id_3 -1.23  0.84
All    All  -0.56  2.68

In [569]:
df4.loc[('F','id_2'),('A','D')]

-0.5

In [583]:
df4.loc[('All','All'),:]=df4.sum()
df4

A-SQUAD         A           B
C-SQUAD         D     C     D     C
gender id
M      id_1  2.38  0.94 -0.91  1.12
       id_2 -1.32 -0.46 -0.07  1.71
       id_3 -0.74 -0.83 -0.10 -0.66
F      id_1  1.13 -1.08 -1.15 -0.44
       id_2 -0.50  1.93  0.95  0.09
       id_3 -1.23  0.84 -1.00 -1.54
All    All  -0.56  2.68 -4.56  0.56

In [587]:
df4.loc[:,('B',slice(None))]

A-SQUAD         B
C-SQUAD         D     C
gender id
M      id_1 -0.91  1.12
       id_2 -0.07  1.71
       id_3 -0.10 -0.66
F      id_1 -1.15 -0.44
       id_2  0.95  0.09
       id_3 -1.00 -1.54
All    All  -4.56  0.56

In [588]:
df4['B']

C-SQUAD         D     C
gender id
M      id_1 -0.91  1.12
       id_2 -0.07  1.71
       id_3 -0.10 -0.66
F      id_1 -1.15 -0.44
       id_2  0.95  0.09
       id_3 -1.00 -1.54
All    All  -4.56  0.56

In [590]:
df4.loc[(slice(None),'id_1'),:]

A-SQUAD         A           B
C-SQUAD         D     C     D     C
gender id
M      id_1  2.38  0.94 -0.91  1.12
F      id_1  1.13 -1.08 -1.15 -0.44